testcases/test01/Test_user_register-Combined-JMeter-and-Selenium.yaml

# Script generated by Blazemeter Chrome Extension

modules:
  nose:
    ignore-unknown-actions: true

execution:
- executor: selenium
  scenario: Test_user_register-Selenium
  
  capabilities: 
    browserName: chrome
  hold-for: 20m

- executor: jmeter
  scenario: Test_user_register-Http
  concurrency: 20
  ramp-up: 1m
  hold-for: 19m

scenarios:
  Test_user_register-Selenium:
    generate-flow-markers: true 
    headless: false
    timeout: 60s
    think-time: 0s
    requests:
    - label: Test
      actions:
      - resizeWindow(1920,945)
      - go(https://demo.automationtesting.in/Register.html)
      - clickByXPath(//input[@placeholder = "First Name"])
      - typeByXPath(//input[@placeholder = "First Name"]): "mercato"
      - typeByXPath(//input[@placeholder = "Last Name"]): "tester"
      - clickByCSS(textarea.form-control.ng-pristine.ng-untouched.ng-valid)
      - typeByCSS(textarea.form-control.ng-valid.ng-dirty.ng-valid-parse.ng-touched): "somewhere there"
      - clickByCSS(input.form-control.ng-pristine.ng-untouched.ng-valid-email.ng-invalid.ng-invalid-required)
      - typeByCSS(input.form-control.ng-valid-email.ng-dirty.ng-valid.ng-valid-required.ng-touched): "mercatorz@gmail.com"
      - clickByCSS(input.form-control.ng-pristine.ng-untouched.ng-invalid.ng-invalid-required.ng-valid-pattern)
      - typeByCSS(input.form-control.ng-dirty.ng-valid-parse.ng-valid-required.ng-invalid.ng-invalid-pattern.ng-touched): "12358978595"
      - clickByName(radiooptions)
      - clickByID(checkbox1)
      - clickByID(checkbox2)
      - clickByID(checkbox3)
      - 'clickByshadow(multi-select, div:nth-of-type(1))'
      - 'clickByshadow(multi-select, li:nth-of-type(18) > a:nth-of-type(1))'
      - clickByXPath(//*[contains(text(), "Languages")])
      - clickByID(Skills)
      - selectByID(Skills): "Engineering"
      - clickByID(countries)
      - clickByID(countries)
      - clickByshadow(multi-select, span)
      - 'clickByshadow(multi-select, div:nth-of-type(1))'
      - 'clickByshadow(multi-select, li:nth-of-type(21) > a:nth-of-type(1))'
      - clickByXPath(//*[contains(text(), "Skills")])
      - clickByID(countries)
      - clickByCSS(span.select2-selection.select2-selection--single)
      - typeByCSS(input.select2-search__field): "p"
      - clickByID(yearbox)
      - selectByID(yearbox): "1978"
      - clickByCSS(select.form-control.ng-pristine.ng-untouched.ng-invalid.ng-invalid-required)
      - selectByCSS(select.form-control.ng-pristine.ng-untouched.ng-invalid.ng-invalid-required): "June"
      - clickByID(daybox)
      - selectByID(daybox): "9"
      - clickByID(firstpassword)
      - typeSecretByID(firstpassword): "!QAZxsw2"
      - typeSecretByID(secondpassword): "!QAZxsw2"
      - clickByID(submitbtn)
      - clickByCSS(input.form-control.ng-dirty.ng-valid-parse.ng-valid-required.ng-invalid.ng-invalid-pattern.ng-touched)
      - typeByCSS(input.form-control.ng-dirty.ng-valid-parse.ng-valid-required.ng-invalid.ng-invalid-pattern.ng-touched): "26358"
      - clickByXPath(//*[contains(text(), "Gender*")])
      - clickByCSS(input.form-control.ng-dirty.ng-valid-parse.ng-valid-required.ng-invalid.ng-invalid-pattern.ng-touched)
      - typeByCSS(input.form-control.ng-dirty.ng-valid-parse.ng-valid-required.ng-invalid.ng-invalid-pattern.ng-touched): "263582341"
      - clickByID(submitbtn)
      - clickByCSS(input.form-control.ng-dirty.ng-valid-parse.ng-valid-required.ng-invalid.ng-invalid-pattern.ng-touched)
      - clickByCSS(input.form-control.ng-dirty.ng-valid-parse.ng-valid-required.ng-invalid.ng-invalid-pattern.ng-touched)
      - doubleClickByCSS(input.form-control.ng-dirty.ng-valid-parse.ng-valid-required.ng-invalid.ng-invalid-pattern.ng-touched)
      - clickByCSS(input.form-control.ng-dirty.ng-valid-parse.ng-valid-required.ng-invalid.ng-invalid-pattern.ng-touched)
      - typeByCSS(input.form-control.ng-dirty.ng-valid-parse.ng-valid-required.ng-touched.ng-invalid.ng-invalid-pattern): "02365897212"
      - clickByID(submitbtn)
      - typeByCSS(input.form-control.ng-dirty.ng-valid-parse.ng-valid-required.ng-touched.ng-invalid.ng-invalid-pattern): "023658972121"
      - clickByID(submitbtn)
      - typeByCSS(input.form-control.ng-dirty.ng-valid-parse.ng-valid-required.ng-touched.ng-valid.ng-valid-pattern): "0236589721"
      - clickByID(submitbtn)
      - clickByID(countries)
      - clickByID(select2-country-container)
      - clickByID(countries)
      - clickByID(countries)
      - clickByID(submitbtn)
      - clickByID(countries)
      - clickByXPath(//*[contains(text(), "Skills")])
      - clickByID(select2-country-container)
      - clickByID(submitbtn)
      - clickByID(countries)
      - clickByID(countries)
      - clickByID(countries)
      - doubleClickByID(countries)
      - clickByID(countries)
      - clickByID(Skills)
      - selectByID(Skills): "C"
      - clickByshadow(multi-select, span)
      - clickByID(countries)
      - clickByID(basicBootstrapForm)
      - clickByID(submitbtn)
      - clickByID(Button1)

  Test_user_register-Http:
    headers:
      sec-ch-ua: '"Google Chrome";v="129", "Not=A?Brand";v="8", "Chromium";v="129"'
      sec-ch-ua-mobile: '?0'
      sec-ch-ua-platform: '"Windows"'
      Upgrade-Insecure-Requests: '1'
      User-Agent: >-
        Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML,
        like Gecko) Chrome/129.0.0.0 Safari/537.36
      Accept: >-
        text/html,application/xhtml+xml,application/xml;q=0.9,image/avif,image/webp,image/apng,*/*;q=0.8,application/signed-exchange;v=b3;q=0.7
    requests:
      - transaction: Test
        force-parent-sample: false
        do:
          - url: 'https://demo.automationtesting.in/Register.html'
            method: GET
            label: 'https://demo.automationtesting.in/Register.html'
            think-time: 0ms
            headers: {}
          - url: >-
              https://googleads.g.doubleclick.net/pagead/html/r20240930/r20190131/zrt_lookup_fy2021.html
            method: GET
            label: >-
              https://googleads.g.doubleclick.net/pagead/html/r20240930/r20190131/zrt_lookup_fy2021.html
            headers:
              X-Browser-Channel: stable
              X-Browser-Year: '2024'
              X-Browser-Validation: g+9zsjnuPhmKvFM5e6eaEzcB1JY=
              X-Browser-Copyright: Copyright 2024 Google LLC. All rights reserved.
          - url: 'https://googleads.g.doubleclick.net/pagead/ads'
            method: GET
            label: 'https://googleads.g.doubleclick.net/pagead/ads'
            headers:
              Sec-Browsing-Topics: ();p=P0000000000000000000000000000000
              X-Browser-Channel: stable
              X-Browser-Year: '2024'
              X-Browser-Validation: g+9zsjnuPhmKvFM5e6eaEzcB1JY=
              X-Browser-Copyright: Copyright 2024 Google LLC. All rights reserved.
            body:
              client: ca-pub-9173866185064071
              output: html
              h: '600'
              slotname: '6638633547'
              adk: '3311696296'
              adf: '858733314'
              pi: t.ma~as.6638633547
              w: '165'
              abgtt: '3'
              fwrn: '4'
              fwrnh: '100'
              lmt: '1658234640'
              rafmt: '1'
              format: 165x600
              url: 'https://demo.automationtesting.in/Register.html'
              fwr: '0'
              rpe: '1'
              resp_fmts: '4'
              wgl: '1'
              uach: >-
                WyJXaW5kb3dzIiwiMTUuMC4wIiwieDg2IiwiIiwiMTI5LjAuNjY2OC43MSIsbnVsbCwwLG51bGwsIjY0IixbWyJHb29nbGUgQ2hyb21lIiwiMTI5LjAuNjY2OC43MSJdLFsiTm90PUE_QnJhbmQiLCI4LjAuMC4wIl0sWyJDaHJvbWl1bSIsIjEyOS4wLjY2NjguNzEiXV0sMF0.
              dt: '1727912247035'
              bpp: '1'
              bdt: '103'
              idt: '56'
              shv: r20240930
              mjsv: m202409250101
              ptt: '9'
              saldr: aa
              abxe: '1'
              cookie: >-
                ID=dc7c0e4bbc274594:T=1727911805:RT=1727911805:S=ALNI_Mbf62QUPgi1wGAdpICZZWx2FlFLmg
              gpic: >-
                UID=00000f2f1c99d5a0:T=1727911805:RT=1727911805:S=ALNI_MZSdfM88rbD3Fel7tE9a3kNQI_jNA
              eo_id_str: >-
                ID=b0e3792bbca3d2d6:T=1727911805:RT=1727911805:S=AA-AfjbxN-1KpKWEftOTjTJG79EG
              correlator: '2209942961699'
              frm: '20'
              pv: '2'
              u_tz: '480'
              u_his: '12'
              u_h: '1080'
              u_w: '1920'
              u_ah: '1032'
              u_aw: '1920'
              u_cd: '24'
              u_sd: '1'
              dmc: '8'
              adx: '382'
              ady: '189'
              biw: '1903'
              bih: '945'
              scr_x: '0'
              scr_y: '0'
              eid: >-
                44759875,44759926,44759842,31087659,44795922,44801779,95341936,95343329,95343823
              oid: '2'
              pvsid: '4116963479944371'
              tmod: '340819185'
              uas: '0'
              nvt: '2'
              ref: 'https://demo.automationtesting.in/Register.html'
              fc: '896'
              brdim: '-1920,182,-1920,182,1920,182,1920,1032,1920,945'
              vis: '1'
              rsz: '||leE|'
              abl: CS
              pfx: '0'
              fu: '128'
              bc: '31'
              bz: '1'
              td: '1'
              tdf: '2'
              psd: W251bGwsbnVsbCxudWxsLDNd
              nt: '1'
              ifi: '1'
              uci: a!1
              fsb: '1'
              dtd: '62'
          - url: 'https://googleads.g.doubleclick.net/pagead/ads'
            method: GET
            label: 'https://googleads.g.doubleclick.net/pagead/ads'
            headers:
              Sec-Browsing-Topics: ();p=P0000000000000000000000000000000
              X-Browser-Channel: stable
              X-Browser-Year: '2024'
              X-Browser-Validation: g+9zsjnuPhmKvFM5e6eaEzcB1JY=
              X-Browser-Copyright: Copyright 2024 Google LLC. All rights reserved.
            body:
              client: ca-pub-9173866185064071
              output: html
              adk: '1812271804'
              adf: '3025194257'
              abgtt: '3'
              lmt: '1658234640'
              plat: >-
                9:32776,16:8388608,17:32,24:32,25:32,30:1081344,32:32,41:32,42:32
              plas: 308x742_l|366x636_r
              format: '0x0'
              url: 'https://demo.automationtesting.in/Register.html'
              pra: '7'
              wgl: '1'
              aihb: '0'
              asro: '1'
              ailel: 1~2~4~6~7~8~9~10~11~12~13~14~15~16~17~18~19~20~21~24~29~30~34
              aiael: 1~2~4~6~7~8~9~10~11~12~13~14~15~16~17~18~19~20~21~24~29~30~34
              aicel: '33'
              aifxl: 29_18~30_19
              aiixl: 29_5~30_6
              aslmct: '0.7'
              asamct: '0.7'
              aiict: '1'
              aiapm: '0.20295'
              aiapmi: '0.24446'
              aiombap: '1'
              aipecl: '1'
              uach: >-
                WyJXaW5kb3dzIiwiMTUuMC4wIiwieDg2IiwiIiwiMTI5LjAuNjY2OC43MSIsbnVsbCwwLG51bGwsIjY0IixbWyJHb29nbGUgQ2hyb21lIiwiMTI5LjAuNjY2OC43MSJdLFsiTm90PUE_QnJhbmQiLCI4LjAuMC4wIl0sWyJDaHJvbWl1bSIsIjEyOS4wLjY2NjguNzEiXV0sMF0.
              dt: '1727912247036'
              bpp: '2'
              bdt: '104'
              idt: '65'
              shv: r20240930
              mjsv: m202409250101
              ptt: '9'
              saldr: aa
              abxe: '1'
              cookie: >-
                ID=dc7c0e4bbc274594:T=1727911805:RT=1727911805:S=ALNI_Mbf62QUPgi1wGAdpICZZWx2FlFLmg
              gpic: >-
                UID=00000f2f1c99d5a0:T=1727911805:RT=1727911805:S=ALNI_MZSdfM88rbD3Fel7tE9a3kNQI_jNA
              eo_id_str: >-
                ID=b0e3792bbca3d2d6:T=1727911805:RT=1727911805:S=AA-AfjbxN-1KpKWEftOTjTJG79EG
              prev_fmts: 165x600
              nras: '1'
              correlator: '2209942961699'
              frm: '20'
              pv: '1'
              u_tz: '480'
              u_his: '12'
              u_h: '1080'
              u_w: '1920'
              u_ah: '1032'
              u_aw: '1920'
              u_cd: '24'
              u_sd: '1'
              dmc: '8'
              adx: '-12245933'
              ady: '-12245933'
              biw: '1903'
              bih: '945'
              scr_x: '0'
              scr_y: '0'
              eid: >-
                44759875,44759926,44759842,31087659,44795922,44801779,95341936,95343329,95343823
              oid: '2'
              pvsid: '4116963479944371'
              tmod: '340819185'
              uas: '0'
              nvt: '2'
              fsapi: '1'
              ref: 'https://demo.automationtesting.in/Register.html'
              fc: '896'
              brdim: '-1920,182,-1920,182,1920,182,1920,1032,1920,945'
              vis: '1'
              rsz: '||s|'
              abl: NS
              fu: '32768'
              bc: '31'
              bz: '1'
              td: '1'
              tdf: '2'
              psd: W251bGwsbnVsbCxudWxsLDNd
              nt: '1'
              ifi: '2'
              uci: a!2
              fsb: '1'
              dtd: '74'
          - url: >-
              https://googleads.g.doubleclick.net/pagead/html/r20240930/r20190131/zrt_lookup_fy2021.html#RS-0-&adk=1812271801&client=ca-pub-9173866185064071&fa=1&ifi=3&uci=a!3
            method: GET
            label: >-
              https://googleads.g.doubleclick.net/pagead/html/r20240930/r20190131/zrt_lookup_fy2021.html#RS-0-&adk=1812271801&client=ca-pub-9173866185064071&fa=1&ifi=3&uci=a!3
            headers:
              Sec-Browsing-Topics: ();p=P0000000000000000000000000000000
              X-Browser-Channel: stable
              X-Browser-Year: '2024'
              X-Browser-Validation: g+9zsjnuPhmKvFM5e6eaEzcB1JY=
              X-Browser-Copyright: Copyright 2024 Google LLC. All rights reserved.
          - url: 'https://tpc.googlesyndication.com/sodar/sodar2/232/runner.html'
            method: GET
            label: 'https://tpc.googlesyndication.com/sodar/sodar2/232/runner.html'
            headers:
              X-Browser-Channel: stable
              X-Browser-Year: '2024'
              X-Browser-Validation: g+9zsjnuPhmKvFM5e6eaEzcB1JY=
              X-Browser-Copyright: Copyright 2024 Google LLC. All rights reserved.
          - url: 'https://www.google.com/recaptcha/api2/aframe'
            method: GET
            label: 'https://www.google.com/recaptcha/api2/aframe'
            headers:
              X-Browser-Channel: stable
              X-Browser-Year: '2024'
              X-Browser-Validation: g+9zsjnuPhmKvFM5e6eaEzcB1JY=
              X-Browser-Copyright: Copyright 2024 Google LLC. All rights reserved.